run/cases/pelletExtruder/old/MRF_SIMPLE/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{  
    
    inlet
    {
        type                flowRateInletVelocity;
        massFlowRate        3e-05;// kg/s
        extrapolateProfile  yes;
        rho                 rho;
        rhoInlet            1040;
        value               uniform (0 0 0);   
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    barrelup
    {
	type            slip;
    }
      
    barreldown
    {
	type            noSlip;
    }
    
    hopperwall
    {
	type            slip;
    }
    
    "screwup.*"
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }
    
    screwdown
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }

}


// ************************************************************************* //
